package com.bank.GUI.Components;

import javax.swing.*;
import java.awt.*;

public class ClientsTable extends JPanel {
    ClientsTable(){
        String[] columnNames = {"ת.ז.", "סטטוס", "יתרה", "מספר לקוח", "מספר חשבון", "שם"};
        String data[][]={ {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
                {"026480996","פעיל","670000","123456","99999","סאמר אלעטאונה"},
        };
        JTable clientsTable = new JTable(data, columnNames);
        clientsTable.setPreferredSize(new Dimension(600,300));

        JScrollPane sp=new JScrollPane(clientsTable);
        sp.setPreferredSize(new Dimension(600,300));

        this.setLayout(new FlowLayout(FlowLayout.RIGHT));
        this.add(sp);

    }
}
